"""
เครื่องคำนวนไฟฟ้าแบบขั้นบันได
เขียนโปรแกรมคำนวนค่าไฟฟ้าที่ใช้ในเดือนนั้น โดยใช้ฟังก์ชั้น  calculate_electricity_cost(units)
 
ค่าไฟฟ้าขึ้นกับปริมาณการใช้งาน
จำนวนหน่วยใช้      อัตราต่อหน่วย
1-50 หน่วยแรก        2.50 บาท
51-100 หน่วย         3.00 บาท
101-200 หน่วย        3.50 บาท
มากกว่า 200 หน่วย     4.00บาท
 
ให้คิดค่าบริการคงที่เพิ่มอีก 25 บาทต่อเดือน
เงื่อนไข
    *   โปรแกรมแสดงเมนูวนซ้ำ
    *   ผู้ใช้เลือก 1 เพื่อคำนวนค่าไฟ
    *   ผู้ใช้เลือก 2 เพื่อออกจากโปรแกรม
    *   หากเลือกเมนูอื่น ให้แจ้งว่าเลือกเมนูไม่ถูกต้อง
    *   จำนวนหน่วยไฟฟ้าต้องไม่คิดลบ
    *   ให้แสดงรายละเอียดค่าไฟแต่ละช่วง และยอดรวมสุทธิ
 
    units = 120         มากกว่า100 ใช้ฟังก์ชันนี้
    cost = (50 * 2.50) + (5 * 3.00) + ((units - 100) * 3.50) + 25
    print(cost)
 
    uints = 225         มากกว่า200 ใช้ฟังก์ชันนี้
    cost = 125.0 + 150.0 + 35.00 + ((uints - 200) * 4.00) + 25
    print(cost)
"""
 
units = int(input("กรอกจำนวนหน่วยไฟฟ้า: "))
 
def calculate_electricity_cost(units):
   
    if units > 200:
        cost = 125.0 + 150.0 + 35.00 + ((units - 200) * 4.00) + 25
        print("1-50 หน่วย: 125.00 บาท")
        print("51-100 หน่วย: 150.00 บาท")
        print("101-200 หน่วย: 350.00 บาท")
        print(f"201-{units} หน่วย: {(units - 200) * 4.00} บาท")
        print("ค่าบริการ: 25.00 บาท")
        print("รวมค่าไฟทั้งสิ้น:", cost, "บาท")
       
 
    elif units > 100:        
        cost = (50 * 2.50) + (5 * 3.00) + ((units - 100) * 3.50) + 25
        print("1-50 หน่วย: 125.00 บาท")
        print("51-100 หน่วย: 150.00 บาท")
        print(f"101-{units} หน่วย: {(units - 100) * 3.50} บาท")
        print("ค่าบริการ: 25.00 บาท")
        print("รวมค่าไฟทั้งสิ้น:", cost, "บาท")
 
    elif units > 50:
        cost = 125.0 + ((units - 50) * 3.00) + 25
        print("1-50 หน่วย: 125.00 บาท")
        print(f"51-{units} หน่วย: {(units - 50) * 3.00} บาท")
        print("ค่าบริการ: 25.00 บาท")
        print("รวมค่าไฟทั้งสิ้น:", cost, "บาท")
 
    elif units > 0:
        cost = units * 2.50 + 25
        print(f"{units} หน่วย: {(units) * 2.50} บาท")
        print("ค่าบริการ: 25.00 บาท")
        print("รวมค่าไฟทั้งสิ้น:", cost, "บาท")
 
    else:
        print("จำนวนหน่วยไฟฟ้าต้องไม่ติดลบ")
 
while(True):
    print("===== โปรแกรมคำนวนค่าไฟฟ้า =====")
    print("1. คำนวนค่าไฟ")
    print("2. ออกจากโปรแกรม")
    choice = input("เลือกเมนู: ")
    if choice == "1":
        units = int(input("กรอกจำนวนหน่วยไฟฟ้า: "))        
        calculate_electricity_cost(units)
    elif choice == "2":
        break
    else:
        print("หากเลือกเมนูอื่นจะแจ้งว่าเลือกเมนูไม่ถูกต้อง")
 